---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialId
source: html/e5373a1f-b213-7f42-8efc-74347a9b3732.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialId Property

The visualization material used for the surface for displaying the energy analytical model.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input element materialId is not a material element.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null